/*导入其它的模块*/
/*第一个参数：导入模块数组(模块的路径)*/
/*备注1：如果模块在写路径的路径有后缀,那么路径参考的基础路径是HTML页面所在的路径*/
/*备注2：如果模块在写路径的路径无后缀,那么路径参考的基础路径是主模块文件所在的路径*/
// require(["./src/A.js","./src/B.js"],function () {
//
//     /*当所有模块加载完执行该函数，备注(不能保证模块的加载顺序)*/
//     console.log("A模块加载完执行的操作",a);
//     console.log("B模块加载完执行的操作",b);
// })


// require(["./A","./B"],function () {
//     /*当所有模块加载完执行该函数，备注(不能保证模块的加载顺序)*/
//     console.log("A模块加载完执行的操作",a);
//     console.log("B模块加载完执行的操作",b);
// })


require(["./src/A.js","./src/B.js"],function () {

    /*当所有模块加载完执行该函数，备注(不能保证模块的加载顺序)*/
    console.log("A模块加载完执行的操作",a);
    console.log("B模块加载完执行的操作",b);
})
